{"version":"1","gitHash":"9675f65fed8bde9b7e1ad99bdf900ff253bdc21f","content":[{"name":"Getting Started","id":"M_42tuQZ5","version":"0.0.1","index":"0","sections":[{"type":"markdown","id":"Y7GR7FtYhU","content":"<h2>New student welcome letter</h2>\n<p>You can read the <a href=\"https://medium.com/@geoff616/techintern-school-new-student-welcome-letter-f1836085244d\" target='_blank'> new student welcome letter here</a> to learn more about the course content and structure.</p>\n","wasMarkdown":true},{"type":"markdown","id":"b7O0eJqHM","content":"<h2>Project 0: New Hire Onboarding</h2>\n<h4><strong>ISE Intro:</strong></h4>\n<p>When you start a new job, your first few days are spent learning about the tools and systems a company uses. Your first project at O&amp;O will guide you through setting up your Mac OS computer. It will introduce you to some of the tools you will need to learn to start creating software. If you come across terms you don’t know, google them. If you still have questions about the meaning of a term or something isn’t clear, you will be able to file an issue after you have created your account by following the instructions below.</p>\n<p>If you are working on another operating system (i.e. Windows/Linux) or run into error messages during the installation, please reach out to geoff@techIntern.school for help getting started.</p>\n<p>In this project we will start by learning how to install software from the command line. This is an alternative to downloading software by clicking on a download link with your mouse. Using tools like homebrew and npm, you gain access to hundreds of thousands of pieces of open source software. This software will help you start developing your own software.</p>\n<p>The command line is a way to interact with your operating system using text commands. You are already familiar with using your mouse to click on applications' Graphic User Interface (GUI), but may not have seen the Command Line Interface (CLI) before. The operating system exposes this through the MacOS terminal application. If you haven't worked in the terminal before, <a href=\"https://www.freecodecamp.org/news/conquering-the-command-line-f85f5e46c07c/\" target='_blank'> here is a link</a> to an introductory article.</p>\n<p>When you install software with a tool like npm, you download the text files that make up the source code of the program. These files are saved in your file system in a folder (Applications/Downloads/...). The folder (directory) that you navigate in the Mac OS Finder application are the same directories that you see in the terminal.</p>\n<p>To start working on projects, you will have to learn the commands to move around the file system. You will also be introduced to tools like GitHub and a text editor.</p>\n<p>GitHub is a platform for developers to share and collaborate on code. <a href=\"https://www.howtogeek.com/180167/htg-explains-what-is-github-and-what-do-geeks-use-it-for/\" target='_blank'> This article</a> provides a good overview. Beyond sharing code, GitHub provides other tools that help develop software. Github Issues help organize the work associated with a repository (repo). <a href=\"https://guides.github.com/features/issues/\" target='_blank'> This article</a> explains more about them. Pull requests help manage multiple people working on a single codebase, and makes it easier to review code for bugs before it is merged.</p>\n<p>A text editor is similar to a word processor (Microsoft Word, Google Docs), but designed to write source code files. The same commands you type into the terminal can also be saved in files and executed - this is called a script. This type of script is one of the building blocks of building software. A text editor can be used to write all kinds of computer programming languges. Including low level languages like C that power your operating system Mac OS, and higher level langugages that render web pages like JavaScript. The text editor we reccomend you <a href=\"https://code.visualstudio.com/\" target='_blank'> install is VS Code</a> - stable macOS version.</p>\n<p>Once you have downloaded that, you are now ready to start your first project. Good luck!</p>\n<p>--</p>\n<p>Welcome to O&amp;O. This document will help you get oriented to the systems and tools we use. We will get your computer setup to start developing software in your next project.</p>\n<p>The application you are reading this project on is called the web portal (WP). It is where you will learn about the projects you will work on, and find links to other resources you will need. Each project will have several challenges that we need you to complete. This project has three challenges. You will first create a Github account and use it to login to the web portal. You will then install the TIS command line interface using the terminal application. The last challenge will require learning more about the file system.</p>\n","wasMarkdown":true},{"type":"challenge","id":"8-qnYajbr","content":{"overview":"Your first challenge will be to create a Github account and use it to login to this application. You can complete this by clicking the login button in the top right hand corner","requirements":[{"id":"zhLKEBKuDk","text":"Create Github Account and Login","isCheckable":false}]}},{"type":"markdown","id":"R2LtBDQzm","content":"<h3>Create github account and login</h3>\n<ol>\n<li>Create a GitHub account by <a href=\"https://github.com/join\" target='_blank'> clicking here</a>.</li>\n<li>Login using your github account by clicking the Login button in the top right hand corner</li>\n</ol>\n<p>Once you are loggen in, the Login button will be replaced with a <code>File an Issue</code> button. If you have any questions about the project requirements, or you believe you have found a problem (bug) you can submit the issue using that link.</p>\n","wasMarkdown":true},{"type":"text","content":"Now we’re going to install the TIS command line interface (CLI). If you have never worked with the terminal before, check out the resources linked above. The CLI is going to be installed using an application Node Package Manager (npm). In order to do this, we need to install a programming language called Node.JS. Unfortunately, NodeJS is not installed by default on OSX. The easiest way to install Node.JS is to use another package manager, called HomeBrew.","id":"gWdTEJiYP"},{"type":"challenge","id":"BDwXOAO3y","content":{"overview":"Install the TIS CLI and submit the challenge from the terminal by following the steps below.","requirements":[{"id":"W1H-Pyrwv0","text":"Submit Challenge 1 from the CLI"}]}},{"type":"markdown","id":"8nfLG07HP","content":"<ul>\n<li>\n<p>Open Terminal: Use spotlight - the magnifying glass in top right corner of your screen - to search for the application called Terminal. Click it to open a new Shell.</p>\n</li>\n<li>\n<p>Install Homebrew: We will follow a slightly modified version of <a href=\"https://www.datacamp.com/community/tutorials/homebrew-install-use\" target='_blank'> these instructions through Homebrew commands</a></p>\n<ul>\n<li>Copy and paste the command below (everything after the <code>$</code>) and paste it into the terminal and press enter. If you see an error message, run the next command to install xcode command line tools. Otherwise, you can skip the next step.<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> xcode-select -p</span>\n</code></pre>\n</li>\n<li>Copy and paste the command below and press enter. You will be prompted for your Mac OS login password. Enter your password then press enter. You will need to accept the terms, and it may take a while to install. Once it is complete, run the first command again, to confirm the installation.<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> sudo xcode-select --install</span>\n</code></pre>\n</li>\n<li>Install Homebrew with the command below<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> /usr/bin/ruby -e <span class=\"hljs-string\">\"<span class=\"hljs-subst\">$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)</span>\"</span></span>\n</code></pre>\n</li>\n<li>Install NodeJS using Homebew:<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> brew install node</span>\n</code></pre>\n</li>\n<li>Download the project repository from GitHub:<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> git <span class=\"hljs-built_in\">clone</span> https://github.com/techintern-school/ise-projects.git</span>\n</code></pre>\n</li>\n<li>Navigate to the projects directory<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> <span class=\"hljs-built_in\">cd</span> ise-projects</span>\n</code></pre>\n</li>\n<li>Install the TIS CLI and the projects application<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> npm install</span>\n</code></pre>\n</li>\n<li>Copy your cofiguration file content from the account tab - you can find this by clicking on the menu in the top left of the app, then clicking the account button</li>\n<li>Open VS Code, paste the file content into a new file. Save the file as <code>.tisConfig.json</code> - with the leading <code>.</code> - in your home directory <code>/Users/{YOUR_MAC_USERNAME}</code></li>\n<li>Navigate to the challenge 1 directory for project 0<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> <span class=\"hljs-built_in\">cd</span> project-0/challenge-1/</span>\n</code></pre>\n</li>\n<li>Submit your challenge for evaluation<pre><code class=\"language-shell\"><span class=\"hljs-meta\">  $</span><span class=\"bash\"> npm run submit</span>\n</code></pre>\n</li>\n<li>If you have done this correctly, the challenge in the web portal will say complete.</li>\n</ul>\n</li>\n</ul>\n","wasMarkdown":true},{"type":"challenge","id":"J-zCwJpQh","content":{"overview":"Create a backup of a folder using the command line","requirements":[{"id":"9z7KSCxGwK","text":"Write a bash script backup-products.sh to copy all files from `/products` to `/backup-products`."}]}},{"type":"markdown","id":"TNGG8tPz5","content":"<p>Unlike the previous project, we will not give you the commands you need to run. You will need to figure this out by googling. You should get started by searching for &quot;how to copy directory command line linux&quot; in Google. It will be easier to test your script directly in the terminal in the <code>/project-0/challenge-2</code> directory. When you believe you have found the command you need, you can submit your solution by saving it in the <code>backup-products.sh</code> file and running <code>npm run submit</code> in <code>/project-0/challenge-2</code>.</p>\n","wasMarkdown":true}]},{"name":"Product Catalog","id":"mISvvHnHq","version":"0.0.1","index":"1","sections":[{"type":"markdown","id":"7J66zU3rB7","content":"<h2>Project 1: Updating Product Catalog</h2>\n<blockquote>\n<h3><strong>ISE Intro:</strong></h3>\n</blockquote>\n<p>In this project, you will learn how to use Python to manipulate data. In the first challenge, you will solve the problem in a spreadsheet. If you have never used spreadsheet functions before, <a href=\"https://zapier.com/learn/google-sheets/google-sheets-tutorial/\" target='_blank'> here is a good tutorial</a>. Once we have solved that problem in the spreadsheet, we will move on to solving it with Python. If you haven’t programmed before, you will likely spend more than a week on this project. The data we will be working with is stored as a csv in the project-1 directory of the project repository you downloaded in project 0. If you are unfamiliar with csv, here is a <a href=\"https://www.howtogeek.com/348960/what-is-a-csv-file-and-how-do-i-open-it/\" target='_blank'> quick explainer</a>.</p>\n","wasMarkdown":true},{"type":"challenge","id":"57aJybXgi","content":{"overview":"O&O is about to receive a new shipment of Nike shoes. We need you to discount all of the existing Nike inventory by 20%. The product catalog is stored in a csv file. We need you to download the catalog, apply the discount to all products that match the filters below, and submit the updated csv catalog in the same format.","requirements":[{"id":"RajXdb5ARI","text":"Submit a csv file where the current_price for products that match - brand == Nike AND category == Shoes - have been reduced by 20%.","isCheckable":false}]}},{"type":"steps","id":"xnE6kewi-","content":{"requirements":[{"id":"cqJfRM6iDy","text":"Import the product_catalog.csv from ise-projects/project-1 into Google Sheets","isCheckable":true},{"id":"Px6gczvjKI","text":"Create Filters for the relevant columns  - brand and category","isCheckable":true},{"id":"TynP0QrM9K","text":"Apply a 20% discount to the current price column for the remaining rows using a formula","isCheckable":true},{"id":"6vTiLC2Bfa","text":"Export the spreadsheet from Google Sheets, and save file as product_catalog_updated.csv in same folder","isCheckable":true},{"id":"fXs67GBAPg","text":"Navigate to the challenge directory: cd ~/ise-projects/project-0/challenge-0/","isCheckable":true},{"id":"NuMT9btFRF","text":"Submit your challenge for evaluation: npm run submit","isCheckable":true}]}},{"type":"markdown","id":"Jn2ru2Vdh","content":"<blockquote>\n<p>Discussion: Why are we learning to use a spreadsheet in a software engineering course? If you have never programmed before, spreadsheets are a great way to visualize programming concepts. Even if you have programmed before, writing code isn’t always the simplest solution. Working with the data in the spreadsheet has the advantage of being able to quickly see all of the values in the columns. Did you notice that some of the values in the brand field said Nike and others nike? We accepted your solution without validating the second case, but don’t worry. We will be coming back to clean this up in a later problem.</p>\n</blockquote>\n<blockquote>\n<p>Let’s quickly recap the steps we performed to solve this problem:</p>\n</blockquote>\n<blockquote>\n<ul>\n<li>Imported the csv file in the spreadsheet application (programming environment)</li>\n<li>Filtered the rows of data to just the ones we needed (Nike/Shoes)</li>\n<li>Applied the transformation (discount current price by 20%)</li>\n<li>Exported the csv file out of the spreadsheet application (programming environment)</li>\n</ul>\n</blockquote>\n<blockquote>\n<p>Note that we are calling the spreadsheet application a programming environment. You had to write a formula (function) to discount the prices. You clicked the buttons in the spreadsheet to solve this problem and solve it much quicker than you could have if you had to program. Especially if you have never programmed before.</p>\n</blockquote>\n<blockquote>\n<p>Fast is great, but does that mean there is no need to program a solution? The short answer is it depends. It depends on the requirements. It depends on how often you need to solve a particular problem. If you never had to do this again, it would be overkill to write a program to do something that you could quickly do in a spreadsheet.</p>\n</blockquote>\n<blockquote>\n<p>What’s that? We need to apply hundreds of these price changes like this a week? Time to write an automated program to help do it.</p>\n</blockquote>\n","wasMarkdown":true},{"type":"challenge","id":"Q0mau9u2A","content":{"overview":"We need to come up with a more efficient way to apply these price changes. We need to write a command-line utility to specify the category, brand, and the percentage change in the price. Write a Python script with the following interface: `solution.py --percent-change 80 --brand Nike --category Shoes`","requirements":[{"id":"20Q5tDZWIG","text":"Write a Python script where the percent-change argument is required, the brand and category arguments are optional. Leave the product_catalog.js file unchanged, and save the updated catalog to `project-1/challenge-1/product_catalog_updated.csv`","isCheckable":false}]}},{"type":"markdown","id":"beQ1XDU8Q","content":"<blockquote>\n<p>This just got more complicated. We will need to learn a bunch of new skills and technologies to solve this problem. It will take a lot longer than the first problem we worked on, but it will be worth it.</p>\n</blockquote>\n<blockquote>\n<p>If you don’t already know how to program in Python, now is the time to start learning. We recommend you use the <a href=\"https://www.py4e.com/\" target='_blank'> Python for Everyone free online course</a>. It has good video lectures, and provides a great introduction to programming. To solve this problem, you will likely need to watch lessons 1-9. There are optional practice exercises using the courses Autograder. These are not required but will help cement what you are learning, and will help you apply what you are learning to solve this problem for O&amp;O.</p>\n</blockquote>\n<blockquote>\n<p>NOTE: The instructions below assume you are working on an OSX computer. If you are using another operating system, please reach out to geoff@techIntern.school for help.</p>\n</blockquote>\n","wasMarkdown":true},{"type":"steps","id":"wQVvohBGu","content":{"requirements":[{"id":"w4qsKmyghr","text":"Start learning python if you don’t already know it","isCheckable":true},{"id":"roxTXN6eOC","text":"Write the python script based on the requirements","isCheckable":true}]}}]},{"name":"coming-soon-1","id":"2TsMSIdtA","version":"0.0.1","index":"2","sections":[{"type":"text","content":"","id":"b5wAEeHqFJ"}]},{"name":"coming-soon-2","id":"AVK7zo11J","version":"0.0.1","index":"3","sections":[{"type":"text","content":"","id":"wRDZtOaF6_"}]}]}