{"version":"1","gitHash":"43265893d2f622115e3137bfb9dc7a577e8fe0c2","content":[{"name":"Getting Started","id":"M_42tuQZ5","version":"0.0.1","index":"0","sections":[{"type":"markdown","id":"Y7GR7FtYhU","content":"<h2>New student welcome letter</h2>\n<p>Welcome to techIntern.school’s Introduction to Software Engineering (ISE). I know you have a lot of choices to learn to become a software engineer (SE). Some online courses focus on teaching a particular technology. Others explain concepts, then work through a series of practice problems in your browser. ISE takes a different approach. You will start working like a SE as we work through projects based on real business problems. Without prior software experience, it will take you at least 6 months of full time (40 hours/week) effort to complete ISE. It will take longer if you are studying part-time. If you want a certification you can add to your resume in six weeks, you should look elsewhere. If you want to learn to use software to solve problems, you are in the right place.</p>\n<p>Along the way, you will learn these five skills to become a professional SE.</p>\n<h4>Skill 1. Learn to get unstuck</h4>\n<p>A surprising percentage of the job of a SE is getting unstuck when you don’t understand something. Being stuck is not fun. The joy of solving a problem that had you stumped is fun for some people. I want you to figure out as soon as possible if you are one of the people who enjoys getting unstuck. If getting unstuck brings you joy, this is the right course for you to learn to become a SE. If not, you can still learn to become a SE, but I don’t recommend doing it here. There are other schools that put less emphasis on developing this skill.</p>\n<p>We will start developing your unstucking skill right away in project 0 when we get your computer setup for ISE. We will develop it further when you start solving projects with programming. It will be challenging. Software engineering is challenging. All worthwhile things are. Without learning to get unstuck, you will have a hard time making progress on software projects.</p>\n<p>ISE will provide links to resources that will help you develop solutions. ISE will not spoon feed you solutions. This is to prepare you for what your software engineering career will be like. As a junior software engineer, you will likely get help figuring out how to approach a problem. It will still be your responsibility to solve it. Solving problems takes practice. It takes time. It takes a lot of not completely understanding things, before they click.</p>\n<p>As you develop your skills, the projects you will work on will get more challenging. I don’t expect you to complete all of these without help. techIntern.school (TIS) will assign your mentor after your first month of studying. Your mentor will be able to help you when you get stuck, but they are not your main source of help. You are. Your time with your mentor is valuable. You will be paying $100/hour for it. Focus your conversations with your mentor more on high-level direction and less on low-level technical questions. If you are unclear what to do next, that is a good thing to discuss. If you don’t understand something, ask your mentor to point you in the direction of a resource that you can use to figure it out.</p>\n<h4>Skill 2. Learn the building blocks</h4>\n<p>The ISE curriculum does not revolve around learning to code. ISE will teach you software engineering. Software Engineering is not about knowing Computer Science trivia. Nor is it about memorizing syntax of programming languages. The primary goal of a professional SE is to solve problems that create business value. You may use programming syntax and CS knowledge as inputs to solve a problem, but they are not the output. The solution you create is the output.</p>\n<p>Unless you are writing in machine code by hand, your software will include software written by others. These are your building blocks. Programming language features are building blocks. Text editors are building blocks. Open source software is a building block. Commercial software are heavily polished building blocks.</p>\n<p>Learning what building blocks exist and how to use them is the next skill you need to develop. ISE projects will expose you to a broad foundation of knowledge and technologies. We won’t go too deep in many technologies. Especially at the beginning. Being able to name a piece of technology and know “it can do X and Y, but not Z” is what we are aiming for at this point. This will be the focus of the second part of the curriculum.</p>\n<h4>Skill 3. Learn to put the building blocks together</h4>\n<p>A single building block is not valuable to a business. Value comes from combining the building blocks in a way that solves the businesses’ end users’ problems. Given a problem, what building blocks will help solve it? How should you combine them? What are the tradeoffs of different solutions? Answering these questions is your core responsibility as a SE.</p>\n<p>Our next set of projects will require combining the building blocks you have learned. You will keep learning new building blocks, but you are now responsible for understanding something else. How the building blocks relate to each other. This composition, and the thought process that goes into it is the next important skill you need to develop.</p>\n<p>The projects you work on to develop this skill will have more challenging requirements. These are the types of projects you can put on your resume. They will also give you something to talk about with prospective employers.</p>\n<h4>Step 4. Learn to work in a team</h4>\n<p>Software engineering is rarely an individual exercise. When you are employed as a SE, you will work as part of a team. The final ISE projects will simulate parts of working in a team. Communication and teamwork are important soft skills you need to develope to being a successful software engineer. What you learn through ISE is no substitute for professional experience. Getting your first job as a professional SE is the next step you need to take.</p>\n<p>Many companies look for internship experience in entry-level hires. It demonstrates the ability to apply what they have learned through their studies. It also provides you (the intern) with valuable skills that are difficult to get through self guided study. This course will prepare you to be an awesome intern. This will lead to your first full-time job as a software engineer.</p>\n<p>TIS will give you the experience you need to get more experience.</p>\n<h4>Skill 5. Learn to be an expert</h4>\n<p>Becoming an expert requires experience. It requires practice. It requires developing your own perspective on a subject. Becoming an expert is out of scope for ISE, but will be your next challenge when you have started gaining experience. There are many specializations in software engineering. You can choose to become an expert in one or more of these domains. How much experience do you need to become an expert? We leave this as an exercise for the student to complete when you are ready.</p>\n<h3>What is TIS?</h3>\n<p>I founded TIS in March 2020 to create the resource I wish I had when I was learning software engineer. You are the first students to go through the ISE course. The online learning platform is under active development. Despite some rough edges, what you will learn will be worth the growing pains. As a software engineer, you will often encounter bugs you didn’t expect when using other people’s software. To resolve the bug, you will have to figure out if the issue is with your software or theirs. During your studies, you can file a bug report at any time if you are not sure why things are not working. Filing good bug reports is an important skill you will need as a software engineer. Describing your bugs as features is another important skill, but I digress.</p>\n<h3>What's next?</h3>\n<p>All of the projects you will work on in ISE will be for a fictional e-commerce company called onandon.com (O&amp;O). O&amp;O has decided to hire you to help develop software for their growing business. They know you don’t have much experience as a software engineer, and have structured your projects to build up your skills.</p>\n<p>Enough talk. Let’s get to work.</p>\n<p>Geoff, founder of techIntern.school</p>\n","wasMarkdown":true},{"type":"markdown","id":"b7O0eJqHM","content":"<h2>Project 0: New Hire Onboarding</h2>\n<blockquote>\n<h3><strong>ISE Intro:</strong></h3>\n</blockquote>\n<blockquote>\n<p>When you start a new job, your first few days are often spent learning about the tools and systems a company uses. Your first project at O&amp;O will guide you through setting up your OSX computer. It will introduce you to some of the tools you will need to learn to start creating software. If you come across terms you don’t know, google them. If you still have questions about the meaning of a term or something isn’t clear, please file an issue using the button in the top right corner. If you have never filed a Github issue before, here is a quick tutorial.</p>\n</blockquote>\n<blockquote>\n<p>If you are working on another operating system (i.e. Windows/Linux) or run into error messages during the installation, please reach out to geoff@techIntern.school for help getting started.</p>\n</blockquote>\n<p>--</p>\n<p>Welcome to O&amp;O. This document will help you get oriented to the systems and tools we use. We will get your computer setup to start developing software in your next project.</p>\n<p>The application you are reading this project on is called the web portal (WP). It is where you will learn about the projects you will work on, and find links to other resources you will need. Each project will have several challenges that we need you to complete. Later in this project, your first challenge will be to download and install the command-line interface (CLI). This application will be used to submit your solutions to the rest of the challenges. There is also a backend service that runs on our servers to keep track of your progress and synchronizes the CLI and WP. Collectively these applications form the learning application. A high level architecture diagram of this system is below in figure 1.</p>\n<p><img src=\"/img/learn-app-arc-0.1.svg\" alt=\"Image\"></p>\n","wasMarkdown":true},{"type":"challenge","id":"8-qnYajbr","content":{"overview":"Your first challenge will be to create a Github account and Star the learning application repository. You should follow the steps below to setup your computer to submit the challenge. When you have sucessfully compelted the challenge, this checkbox automatically be checked.","requirements":[{"id":"zhLKEBKuDk","text":"Star the learn-app repo","isCheckable":false}]}},{"type":"steps","id":"R2LtBDQzm","content":{"requirements":[{"id":"1icj9acz","text":"Go to https://github.com/join?source=techIntern.school and signup","isCheckable":true},{"id":"-l456x5yWr","text":"Star https://github.com/techintern-school/learn-app","isCheckable":true}]}},{"type":"text","content":"Now we’re going to install the command line interface. If you have never worked with the terminal before, check out the resources below. The CLI is going to be installed using an application Node Package Manager (npm). In order to do this, we need to install a programming language called Node.JS. Unfortunately, NodeJS is not installed by default on OSX. The easiest way to install Node.JS is to use another package manager, called HomeBrew. ","id":"gWdTEJiYP"},{"type":"steps","id":"E_avmblRu","content":{"requirements":[{"id":"WQvZ93FdLG","text":"Install Homebrew: Follow instructions until HomeBrew commands: https://www.datacamp.com/community/tutorials/homebrew-install-use","isCheckable":true},{"id":"jBYG2f4BiB","text":"Install Node: brew install node","isCheckable":true},{"id":"EHtNd6EpVv","text":"Download the repository to your computer: git clone https://github.com/techintern-school/ise-projects.git","isCheckable":true},{"id":"q6_mS9sPtw","text":"navigate to the repo directory: cd ise-projects","isCheckable":true},{"id":"2W32OWssb6","text":"install the application: npm install","isCheckable":true},{"id":"-5cgsrSvTu","text":"Run the setup command: npm run setup","isCheckable":true},{"id":"u-6p7G-x8J","text":"Enter your user ID then hit enter - you can find this by clicking on the menu in the top left of the app, then clicking the account button, and copying the value","isCheckable":true},{"id":"b8c4MD-mHF","text":"Enter your github ID then hit enter - you can find this in the github website","isCheckable":true},{"id":"b8c4MD-mHFz","text":"Navigate to the challenge directory: cd ~/ise-projects/project-0/challenge-0/","isCheckable":true},{"id":"iC7Cq5Im76","text":"Submit your challenge for evaluation: npm run submit","isCheckable":true}]}},{"type":"text","content":"You should see the checkbox under the challenge marked as complete. Once that is done, mark this project by clicking on the purple button below and we will move onto the next project. ","id":"t42HQJ9GP"}]},{"name":"Product Catalog","id":"mISvvHnHq","version":"0.0.1","index":"1","sections":[{"type":"markdown","id":"7J66zU3rB7","content":"<h2>Project 1: Updating Product Catalog</h2>\n<blockquote>\n<h3><strong>ISE Intro:</strong></h3>\n</blockquote>\n<p>In this project, you will learn how to use Python to manipulate data. In the first challenge, you will solve the problem in a spreadsheet. If you have never used spreadsheet functions before, here is a good tutorial [TODO link]. Once we have solved that problem in the spreadsheet, we will move on to solving it with Python. If you haven’t programmed before, you will likely spend at least a week on this project. The data we will be working with is stored as a csv in the project-1 directory of the project repository you downloaded in project 0. If you are unfamiliar with csv, here is a <a href=\"https://www.howtogeek.com/348960/what-is-a-csv-file-and-how-do-i-open-it/\">quick explainer</a>.</p>\n","wasMarkdown":true},{"type":"challenge","id":"57aJybXgi","content":{"overview":"O&O is about to receive a new shipment of Nike shoes. We need you to discount all of the existing Nike inventory by 20%. The product catalog is stored in a csv file. We need you to download the catalog, apply the discount to all products that match the filters below, and submit the updated csv catalog in the same format.","requirements":[{"id":"RajXdb5ARI","text":"Submit a csv file where the current_price for products that match - brand == Nike AND category == Shoes - have been reduced by 20%.","isCheckable":false}]}},{"type":"steps","id":"xnE6kewi-","content":{"requirements":[{"id":"cqJfRM6iDy","text":"Import the product_catalog.csv from ise-projects/project-1 into Google Sheets","isCheckable":true},{"id":"Px6gczvjKI","text":"Create Filters for the relevant columns  - brand and category","isCheckable":true},{"id":"TynP0QrM9K","text":"Apply a 20% discount to the current price column for the remaining rows using a formula","isCheckable":true},{"id":"6vTiLC2Bfa","text":"Export the spreadsheet from Google Sheets, and save file as product_catalog_updated.csv in same folder","isCheckable":true},{"id":"fXs67GBAPg","text":"Navigate to the challenge directory: cd ~/ise-projects/project-0/challenge-0/","isCheckable":true},{"id":"NuMT9btFRF","text":"Submit your challenge for evaluation: npm run submit","isCheckable":true}]}},{"type":"markdown","id":"Jn2ru2Vdh","content":"<blockquote>\n<p>Discussion: Why are we learning to use a spreadsheet in a software engineering course? If you have never programmed before, spreadsheets are a great way to visualize programming concepts. Even if you have programmed before, writing code isn’t always the simplest solution. Working with the data in the spreadsheet has the advantage of being able to quickly see all of the values in the columns. Did you notice that some of the values in the brand field said Nike and others nike? We accepted your solution without validating the second case, but don’t worry. We will be coming back to clean this up in a later problem.</p>\n</blockquote>\n<blockquote>\n<p>Let’s quickly recap the steps we performed to solve this problem:</p>\n</blockquote>\n<blockquote>\n<ul>\n<li>Imported the csv file in the spreadsheet application (programming environment)</li>\n<li>Filtered the rows of data to just the ones we needed (Nike/Shoes)</li>\n<li>Applied the transformation (discount current price by 20%)</li>\n<li>Exported the csv file out of the spreadsheet application (programming environment)</li>\n</ul>\n</blockquote>\n<blockquote>\n<p>Note that we are calling the spreadsheet application a programming environment. You had to write a formula (function) to discount the prices. You clicked the buttons in the spreadsheet to solve this problem and solve it much quicker than you could have if you had to program. Especially if you have never programmed before.</p>\n</blockquote>\n<blockquote>\n<p>Fast is great, but does that mean there is no need to program a solution? The short answer is it depends. It depends on the requirements. It depends on how often you need to solve a particular problem. If you never had to do this again, it would be overkill to write a program to do something that you could quickly do in a spreadsheet.</p>\n</blockquote>\n<blockquote>\n<p>What’s that? We need to apply hundreds of these price changes like this a week? Time to write an automated program to help do it.</p>\n</blockquote>\n","wasMarkdown":true},{"type":"challenge","id":"Q0mau9u2A","content":{"overview":"We need to come up with a more efficient way to apply these price changes. We need to write a command-line utility to specify the category, brand, and the percentage change in the price. Write a Python script with the following interface: `solution.py --percent-change 80 --brand Nike --category Shoes`","requirements":[{"id":"20Q5tDZWIG","text":"Write a Python script where the percent-change argument is required, the brand and category arguments are optional. Leave the product_catalog.js file unchanged, and save the updated catalog to `project-1/challenge-1/product_catalog_updated.csv`","isCheckable":false}]}},{"type":"markdown","id":"beQ1XDU8Q","content":"<blockquote>\n<p>This just got more complicated. We will need to learn a bunch of new skills and technologies to solve this problem. It will take a lot longer than the first problem we worked on, but it will be worth it.</p>\n</blockquote>\n<blockquote>\n<p>If you don’t already know how to program in Python, now is the time to start learning. We recommend you use the <a href=\"https://www.py4e.com/\">Python for Everyone free online course</a>. It has good video lectures, and provides a great introduction to programming. To solve this problem, you will likely need to watch lessons 1-9. There are optional practice exercises using the courses Autograder. These are not required but will help cement what you are learning, and will help you apply what you are learning to solve this problem for O&amp;O.</p>\n</blockquote>\n<blockquote>\n<p>NOTE: The instructions below assume you are working on an OSX computer. If you are using another operating system, please reach out to geoff@techIntern.school for help.</p>\n</blockquote>\n","wasMarkdown":true},{"type":"steps","id":"wQVvohBGu","content":{"requirements":[{"id":"w4qsKmyghr","text":"Start learning python if you don’t already know it","isCheckable":true},{"id":"roxTXN6eOC","text":"Write the python script based on the requirements","isCheckable":true}]}}]}]}